## Terraform Plan
#### Terraform Format: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp_iam.google_service_account.vertex_account will be created
  + resource "google_service_account" "vertex_account" {
      + account_id = "vertex-account"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "aitech-good-S17919"
      + unique_id  = (known after apply)
    }

  # module.gcp_iam.google_service_account_iam_member.vertex_account_admin will be created
  + resource "google_service_account_iam_member" "vertex_account_admin" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/aiplatform.admin"
      + service_account_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>